/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   token.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: opanikov <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/06/04 19:10:00 by opanikov          #+#    #+#             */
/*   Updated: 2024/06/04 19:29:17 by opanikov         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "heder.h"

void	lexer(t_info info)
{
	t_token token;

	token = malloc(sizeof(t_token));
	if(!token)
	{
		free_list(&info); //написать функцию очистки листа
		exit(1);
	}

}